Jeka725/Flipper-Zero-ESP32-Port/sdkconfig.defaults.esp32s3_st7735
# ESP32-S3 N16R8 + ST7735S board-specific configuration.
# Base Wi-Fi/BLE/FreeRTOS/PSRAM settings come from sdkconfig.defaults.esp32s3.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota_16mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_ota_16mb.csv"

# 8 MB OPI PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Keep Wi-Fi and BLE enabled.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y

# The board has no SD card; do not enable USB MSC as a hardware SD feature.
CONFIG_TINYUSB_MSC_ENABLED=n
